{"pages":[{"title":"关于我","text":"我是谁？你好，我是张三，欢迎你来到我的博客，希望你有所收获。 张三是谁？ 电商设计大佬（梦里有过） C4D大佬（梦里有过） Blender大佬（梦里有过） 咸鱼一个（这个倒不曾梦过，目前现实中的自己…..） 庸庸碌碌过了好些年，C4D麻溜的安装卸载到Blender熟练的创建删除立方体 就在1分钟前，我问了自己一个问题 上一次觉得自己很有成就是什么时候？ 想了很久我依然回答不出来，这一瞬间无法形容的难受在身体里横冲直撞。 今天 我想对自己做一些改变。 不论是改变自己还是改变别人的看法都是非常的艰难，瞎忙活十级的我决定把自己要所做所想公开出来，让更多的小伙伴鞭策我前进。 我要做什么？在短暂的青春中总会有一些深深刻在心里的片段，不论是梦想还是遗憾。 我想把这些片段通过三维软件做出来，不论好坏，那是未曾做到的另一个自己。 这是我想使用三维软件的最终目的，在这之前我得养活自己，怎么养活自己是个巨大的问题！ 家里没有矿，没有存款，没有特长、失业 我目前能想到的就是通过三维电商设计赚钱养活自己，产品渲染，三维广告图这是我为之努力的方向。 2022我准备怎么做？在很长一段时间里我一直在学习、学习，看过很多教程 青之巅翻译的建模宝典 R站翻译多部教程 MographPlus的渲染教程 GSG灰猩猩的教程 曾神的C4D教程 B站好猫、王也道长翻译的Blender教程 ………等等 然而我自己的作品却一个都有，一看就会，脱离教程一做就废。 我陷入了无限学习、无限准备的误区，如封面图的台阶，本可以挑战自我欣赏登顶的风景，我却想等我长大了、腿长了就可以上去了。 我开始反思我这是怎么了？ 我丢失了一颗强者之心，强，不一定在于实力，心强，也是强。 不够莽，太多的顾虑，想等到什么条件都满足了才敢一战。 怎么办😰？ 挑战自己 每次做的东西必须有自己不会的地方，暂时放弃系统学习的想法，先把图做起来，遇到问题再去找答案。 三维技术和游泳一样，不仅仅是知识，更是技能，技能只看是学不会的。 总结下自己2022年，我给自己贴了几个关键字 挑战：挑战自己，找回那丢失的强者之心 分享：以教为学，把自己学到的知识分享出来，只有自己会了才能讲出来。","link":"/about/index.html"}],"posts":[{"title":"Blender根据视图角度创建摄像机","text":"https://feirenx-1302537874.file.myqcloud.com/img/BL003_C.jpg 1.你有没有遇到这样的问题？ 在Blender视图中你费尽千辛万苦调整好了视图的角度，当你进入摄像机视图后发现完全不是你想要的角度，怎么办？ 在线等~~~挺急的 2.解决办法 这个问题好办，我是张三，跟着我走3分钟教会你 2.1 在Blender点击添加菜单→网格→猴头，创建一个可爱的猴头，按快捷键Shift+A可以弹出创建菜单。 2.2 按快捷键【N】，在右侧弹出的视图菜单→视图锁定→勾选锁定摄像机到视图方位 2.3 在视图菜单→对齐视图→活动摄像机对齐当前视角，快捷键是按【Ctlr+ALT+0】 完结~撒花✿✿ヽ(°▽°)ノ✿，恭喜你又学会了一个小技巧。 什么？三分钟了你还没学会？ 我是张三，我的QQ是：152746199 我不包吃，不包住，但是这个技巧我可以包你会，有问题请愉快的Q我！","link":"/e76556a7/"},{"title":"如何解决Blender预览正常渲染无灯光照明","text":"1.你有没有遇到这样的问题？ 历经坎坷做了一个作品，Blender预览渲染的图那个漂亮，都想给自己点个赞👍🏻，奖励鸡腿都在网上订了一大袋，满怀期待的点了正式渲染按钮，准备静静欣赏一个小时。 结果却发现正式渲染图灯光非常的暗、金属材质也缺少真实的反射，明明我的预览渲染图那么的好看，怎么办？ 在线等~~~挺急的 2.解决办法 2.1 产生这个问题的原因说问题之前需要先了解一个单词：HDRI DHRI的全名叫做高动态范围图像，是一个特殊的图像格式，除了保存图像颜色信息还能保存亮度信息，在HDRI中白色在三维软件中经常用于创建真实的照明和反射或者作为背景使用。 Blender可能出于方便用户调试材质和预览渲染的原因，提供了8个HDRI的环境。但是这8个HDRI环境并没有参与最终渲染，所以导致预览渲染和正式渲染的结果相差非常大。 解决的思路是我们去Blender安装目录把这8个HDRI环境复制出来，由我们自己添加到环境中去，这样正式渲染就拥有和预览图一样的HDRI环境。 2.2 导出Blender默认提供的HDRI文件Windows系统的HDRI路径默认在C:\\Program Files\\Blender Foundation\\Blender 3.1\\3.1\\datafiles\\studiolights\\world文件夹中 Mac系的HDRI路径默认在/Applications/Blender3.2.app/Contents/Resources/3.2/datafiles/studiolights/world 文件夹中 把这几个文件复制到你喜欢保存的文件夹中 2.3 如何调用导出的HDRI文件在菜单栏顶部切换到Shading工作区→切换着色器数据类型为世界环境→添加→纹理→环境纹理→在节点编辑器中打开之前导入的Blender默认HDRI文件,把节点连接上去，现在正式渲染和预览渲染的照明反射就相同，就大功告成。 恭喜你，又学会了一个小技巧，赶紧给你的小伙伴分享一下吧。 3. 补充知识点Blender视图着色方式中场景灯光和场景世界是什么意思？ 场景灯光 在我们没有创建任何灯光的情况，Blender提供了一个默认的灯光。勾选场景灯光后，Blender默认灯光就会自动关闭，使用我们自己创建灯光进行照明。 场景世界 点击预览球可以在8个HDRI中相互切换，勾选场景世界后，Blender就会关闭默认提供的HDRI环境，启用我们自己创建的HDRI环境照明，这就是为什么预览渲染和正式渲染的照明结果不一致的原因。 旋转 调整HDRI的角度，比如让DHRI图中的窗户对着场景会让场景更亮。 什么？20分钟了你还没学会？ 我是张三，我的QQ是：152746199 我不包吃，不包住，但是这个技巧我可以包你会，有问题请愉快的Q我！","link":"/202207110940/"},{"title":"Blender应用变换的原理","text":"你有没有遇到这样的问题？ 在学习blender的时候经常要使用应用位置、缩放、旋转命令，为什么隔壁火热的“西四帝”没有这个繁琐的操作，Blender却如此优秀，频繁锻炼你发财的小手？ 先来看看不应用位置、缩放、旋转命令会产生最常见什么问题？ 倒角命令及倒角生成器产生错误倒角 编辑模式下内插面、法线挤出面的问题 UV拉伸问题 无法列出所有的问题进行说明，比如编辑模式下新建圆环等比缩放拉伸问题，动画问题等等，解决办法文章下方有说明。 倒角命令及倒角生成器产生的错误倒角问题场景中有2个一样大小的立方体 前面这个长方体是缩放未使用应用缩放命令，后边的长方体是应用过缩放命令。两个立方体分别选择一个边倒角后，没有应用过变换命令的长方体倒角被拉伸；使用倒角生成器进行统一倒角后未使用应用缩放也产生了严重的倒角拉伸。 编辑模式下内插面、法线挤出面、新建对象缩放的问题内插面因为在物体模式下缩放导致边距不均匀 法线挤出面勾选均等偏移依然不均等问题 UV拉伸问题给立方体创建默认材质→赋予默认的棋盘格纹理，正常如下图 刚才创建正常的立方体进行Y轴放大2倍，观察棋盘格纹理发现已经被拉伸得严重 解决办法 倒角命令、倒角生成器、内插面、法线挤出错误解决办法在物体菜单→应用→应用位置、旋转、缩放或者应用全部变换就能解决 UV因为缩放导致拉伸解决办法UV拉伸得解决办法还要多一步操作，在纹理坐标中切换到物体模式 我认为的原理说明：这个原理不一定正确，只是我个人查阅资料理解而成 原理比较复杂一些，如果不想了解也没关系知道怎么解决就行了，毕竟很多小伙伴只需要知道踩下油门车能走就行，至于为什么踩油门车可以走起来适合那些有点小闲，有较大好奇心的小伙伴。 我个人认为原理涉及到以下几个知识点 对象的概念 网格的概念 对象和网格的关系 优先级概念 应用变换的背后做了什么？ 对象的概念Blender中创建一个猴头，在大纲视图中可以看到有个猴头名字的额黄色对象，这就是对象。 对象我理解为是个合集，可以比如成一“盒子”，盒子里面装着灯光就是灯光对象，盒子里面装的是网格就是网格对象。 网格的概念Blender创建一个猴头可以在大纲视图中展开网格对象，看到一个绿色三角形标志写着猴头，这个就是网格。 网格是什么？ 点、边、面的合集就是网格。 在编辑模式下可以看到有点、线、面，改变点、边、面的位置从而形成模型，这就是我们建模的过程。 对象和网格的关系在三维软件中每个东西都有自己的坐标轴，对象和网格都有自己的坐标系统。 对象是个“大盒子”改变自己的坐标进行移动、旋转、缩放也会带动里面的网格这个“小盒子”进行移动、旋转、缩放。需要注意是比如对象在Y轴缩放了3倍，在对象自己的坐标轴中可以看到坐标是X1、Y3、Z1，但是网格自己的坐标可是没有变化的依然是X1、Y1、Z1。 这里还需要了解个小知识点，Blender物体模式操作的就是对象，Blender编辑模式操作的对象就是网格 我的数学是体育老师教的，我先来做个计算 创建1个默认大小2米的立方体（称为1号立方体），在物体模式缩放坐标Y轴中输入数值3，这样立方体对象的大小是X轴2米，Y轴2*3米，Z轴是2米，那么请问立方体的网格是多大？ 这个推测非常重要我另起一行加粗表示 我推测立方体的网格依然是X轴2米，Y轴2米，Z轴是2米，也就是所物体本身的数据并没有被改变，要改变物体本身的数据需要进入编辑模式改变。 复制这个立方体到旁边（称为2号立方体），按Ctrl+A 应用缩放，在物体模式可以看到缩放的坐标是X1、Y1、Z1,此时2号立方体的大小是X轴2米，Y轴6米，Z轴2米 接下来分别给两个立方体添加一个倒角生成器，倒角数值是0.1，可以看到1号立方体倒角出现了拉伸的问题，2号立方体倒角正常。 发生了什么？为什么都是一样大小的立方体进行一样的倒角，出现了截然不同的结果？ 为了解释这个问题，这里引入一个优先级别的概念 优先级别的概念优先级别看名字很好理解，就是谁先谁后嘛，了解优先级别后我们就可以来看看倒角出现问题的根本原因。 同样都是2个一样大小的立方体，分别添加倒角生成器后，1号立方体为什么出错了呢？而且出错的地方非常巧合的出现在了我们缩放了3倍大小的Y轴。 我推测导致错误的原因是因为优先级别导致的，还记得创建1号立方体时候我有个加粗的推测，在对象模式下缩放对象，放大模型并没有真正改变模型网格的数据。 倒角生成器的优先级别比对象级别高，是先计算倒角后计算对象的缩放数值 展开这个过程就是，倒角生成器先基于立方体网格(X轴2米、Y轴2米、Z轴2米)的尺寸做了倒角，然后再计算对象缩放坐标轴上的Y轴放大3倍，这样就导致了倒角在Y轴上被拉长了。 产生错误的原因总算推测完了接下来看看为什么应用变换后的2号立方体倒角正常，这背后又发生了什么？ 应用变换命令做了什么事情？应用变换做的事情其实很简单，还是来拿1号立方体来距离 1号立方体本身的网格大小是X轴2米、Y轴2米、Z轴2米，通过对象的Y轴缩放3倍达到了6米的长度，我应用缩放就是把对象的缩放数值传递给了网格本身，这样对象的缩放数值就是X1、Y1、Z1，网格本身的大小就是X轴2米、Y轴6米、Z轴2米. 这样倒角命令在2号立方体的计算是什么过程？ 倒角生成器对2号立方体网格本身的大小（X轴2米、Y轴6米、Z轴2米）进行倒角，然后乘以对象的缩放值（X1、Y1、Z1） 这样2号立方体的倒角并没有被拉伸，倒角完美。 恭喜你又学会了一个Blender的小技巧，赶紧给你的朋友分享一下你学到的知识吧。 总结 不要在物体模式下缩放对象，进入编辑模式缩放模型就不会出现这个问题，出现了问题也不要慌应用变换就能解决 应用变换就是对象的变换数值传递给网格本身，并把对象的变换数值重置为位置0、旋转0、缩放1（应用全部变换就3个都重置，如果只是应用缩放并不会改变位置和旋转的数值） 基于网格的计算优先级大于对象的变换计算，网格在前，对象在后。 说明这篇文章的内容只是我的推测结果，并不意味着完全正确，非常欢迎有大佬给我指出错误的地方。 我是张三，我的QQ是：152746199 我不包吃，不包住，但是这个技巧我可以包你会，有问题请愉快的Q我！","link":"/202207121236/"}],"tags":[{"name":"摄像机","slug":"摄像机","link":"/tags/%E6%91%84%E5%83%8F%E6%9C%BA/"},{"name":"Blender渲染","slug":"Blender渲染","link":"/tags/Blender%E6%B8%B2%E6%9F%93/"},{"name":"BL基础","slug":"BL基础","link":"/tags/BL%E5%9F%BA%E7%A1%80/"}],"categories":[{"name":"blender","slug":"blender","link":"/categories/blender/"},{"name":"摄像机","slug":"blender/摄像机","link":"/categories/blender/%E6%91%84%E5%83%8F%E6%9C%BA/"},{"name":"渲染","slug":"blender/渲染","link":"/categories/blender/%E6%B8%B2%E6%9F%93/"},{"name":"BL基础","slug":"blender/BL基础","link":"/categories/blender/BL%E5%9F%BA%E7%A1%80/"}]}